{
  "alexander-acosta": "Alexander Acosta served as U.S. Attorney for the Southern District of Florida when he approved a controversial 2008 plea deal that allowed Jeffrey Epstein to plead guilty to state charges and serve just 13 months. The deal, later found to have violated the Crime Victims' Rights Act, shielded Epstein and unnamed co-conspirators from federal prosecution. Acosta later served as U.S. Secretary of Labor but resigned in 2019 after renewed scrutiny of the plea agreement.",
  "annie-farmer": "Annie Farmer is one of the few Epstein accusers who chose to be publicly identified. She has testified that she was recruited at age 16 and abused by both Jeffrey Epstein and Ghislaine Maxwell at Epstein's New Mexico ranch. Farmer was a key witness in the 2021 federal trial of Ghislaine Maxwell and has been an advocate for survivors of trafficking.",
  "barack-obama": "Barack Obama's name has appeared in discussions surrounding the Epstein files in the context of political figures mentioned in unsealed documents. There is no evidence in court records of any personal relationship with Epstein or wrongdoing. Obama has not been accused of any involvement in Epstein's crimes.",
  "bill-clinton": "Bill Clinton's name appears in Epstein's flight logs multiple times, documenting trips on Epstein's private aircraft. Clinton has acknowledged meeting Epstein but has denied any knowledge of or involvement in criminal activity. Unsealed court documents include testimony from witnesses who placed Clinton on Epstein's private island, which Clinton's representatives have disputed.",
  "bill-gates": "Bill Gates met with Jeffrey Epstein on multiple occasions between 2011 and 2014, after Epstein's 2008 conviction, according to reporting by The New York Times and The Wall Street Journal. Gates has said the meetings were related to philanthropy and that he regrets the association. Flight logs show Gates traveled on Epstein's aircraft at least once. Gates has denied any knowledge of or involvement in Epstein's crimes.",
  "dave-min": "Dave Min is a U.S. Representative from California who has been vocal in congressional efforts to investigate the Epstein case and push for greater transparency in the release of related documents.",
  "donald-trump": "Donald Trump had a well-documented social relationship with Jeffrey Epstein in the 1990s and early 2000s. Trump was quoted in a 2002 New York Magazine profile describing Epstein as a 'terrific guy.' Trump's name appears in Epstein's flight logs and contact book. Trump has said he had a falling out with Epstein and banned him from Mar-a-Lago. He has denied any involvement in Epstein's crimes.",
  "edgars-rinkevics": "Edgars Rinkēvičs is the President of Latvia whose name appeared in documents released as part of the Epstein files. Latvian authorities have faced calls to investigate the nature of any connections. Rinkēvičs has not been accused of wrongdoing in connection with Epstein.",
  "ehud-barak": "Ehud Barak, former Prime Minister of Israel, had a documented relationship with Jeffrey Epstein. Photographs show Barak visiting Epstein's New York residence, and he has acknowledged receiving funding from Epstein-linked entities for a technology venture. Barak has denied any knowledge of or involvement in criminal activity.",
  "elon-musk": "Elon Musk's name has appeared in discussions related to the Epstein files. A photograph of Musk with Ghislaine Maxwell at a 2014 event circulated widely. Musk has said the photo was taken at a public event and that he did not have a personal relationship with either Epstein or Maxwell.",
  "ghislaine-maxwell": "Ghislaine Maxwell was convicted in December 2021 on five federal charges including sex trafficking of a minor. She was found to have recruited and groomed underage girls for Jeffrey Epstein over a period of years. Maxwell was sentenced to 20 years in federal prison in June 2022. She was Epstein's longtime associate and, according to multiple victims, a central participant in his trafficking operation.",
  "gitanas-nauseda": "Gitanas Nausėda is the President of Lithuania whose name appeared in documents associated with the Epstein files. There is no public evidence of any personal involvement with Epstein's criminal activities. Nausėda has not been accused of wrongdoing.",
  "hillary-clinton": "Hillary Clinton's name has appeared in Epstein-related discussions primarily due to her husband Bill Clinton's documented connections to Epstein. There is no evidence in court records of any direct personal relationship between Hillary Clinton and Epstein, and she has not been accused of any involvement in his crimes.",
  "howard-lutnick": "Howard Lutnick, CEO of Cantor Fitzgerald, has been named in Epstein-related documents. His name appeared in Epstein's contact book. Lutnick has acknowledged knowing Epstein socially but has denied any involvement in or knowledge of criminal activity.",
  "james-comey": "James Comey, former Director of the FBI, has been referenced in discussions about law enforcement handling of the Epstein case. Questions have been raised about federal oversight during the period when Epstein was under investigation. Comey has not been accused of any personal involvement with Epstein.",
  "jamie-raskin": "Jamie Raskin is a U.S. Representative from Maryland who has been a prominent voice in Congress calling for full transparency and disclosure of all Epstein-related documents. He has pushed for congressional investigations into how the case was handled by federal agencies.",
  "jean-luc-brunel": "Jean-Luc Brunel was a French modeling agent accused of procuring young women and girls for Jeffrey Epstein. He was arrested in Paris in December 2020 on charges of rape of minors and sexual harassment. Brunel was found dead in his prison cell in February 2022 in what French authorities ruled a suicide. Multiple Epstein accusers named Brunel as a co-conspirator in court filings.",
  "jeffrey-epstein": "Jeffrey Epstein was a financier and convicted sex offender who operated a trafficking network spanning multiple states and countries. He was first convicted in 2008 under a controversial plea deal in Florida. He was arrested again in July 2019 on federal sex trafficking charges and was found dead in his jail cell in August 2019, with his death ruled a suicide. Unsealed court documents have revealed connections to numerous prominent figures worldwide.",
  "john-phelan": "John Phelan is a Florida-based hedge fund manager whose name appeared in Epstein's flight logs and contact records. Phelan's connections to Epstein have drawn scrutiny, particularly given his involvement in Florida political circles. He has not been accused of involvement in criminal activity.",
  "kimbal-musk": "Kimbal Musk, entrepreneur and brother of Elon Musk, has been referenced in Epstein-related documents. The nature and extent of any connection to Epstein remain subjects of public interest. He has not been accused of wrongdoing.",
  "les-wexner": "Les Wexner, billionaire founder of L Brands (Victoria's Secret), had one of the most extensive documented financial relationships with Jeffrey Epstein. Wexner granted Epstein power of attorney and transferred to him the New York mansion that later became central to trafficking allegations. Wexner has said he severed ties with Epstein in 2007 and that Epstein misappropriated funds. Congressional inquiries have sought testimony about the full extent of their financial arrangements.",
  "michelle-obama": "Michelle Obama's name has appeared in Epstein-related document releases. There is no evidence in court records of any personal relationship with Epstein or involvement in his criminal activities.",
  "miroslav-lajcak": "Miroslav Lajčák is a Slovak diplomat who served as President of the UN General Assembly. His name appeared in Epstein-related documents, leading to his resignation from an advisory role in Slovak politics. Lajčák has not been charged with any crime related to Epstein.",
  "nancy-mace": "Nancy Mace is a U.S. Representative from South Carolina who has been active in congressional efforts to release Epstein-related documents and hold accountable those involved in the case. She has called for full public disclosure of all names in the files.",
  "pam-bondi": "Pam Bondi serves as U.S. Attorney General. She has been a central figure in the DOJ's release of Epstein-related files, overseeing what the department has described as a complete disclosure of relevant documents. Critics have questioned whether the releases have been truly comprehensive, with some members of Congress calling for independent verification.",
  "patrick-davis": "Patrick Davis has been referenced in Epstein-related documents and reporting. Details about his specific connections to Epstein are part of ongoing public scrutiny of the released files.",
  "paul-engelmayer": "Paul Engelmayer is a U.S. District Judge who has presided over Epstein-related litigation. He has been involved in decisions regarding the unsealing of documents in cases connected to Epstein and Ghislaine Maxwell.",
  "peter-mandelson": "Peter Mandelson, a British Labour politician and life peer, has been named in Epstein-related documents. His name appeared in Epstein's contact book and flight logs. Mandelson has acknowledged meeting Epstein but denies any close relationship or knowledge of criminal activity. British authorities have faced calls to investigate his connections.",
  "peter-thiel": "Peter Thiel, billionaire venture capitalist and PayPal co-founder, has been named in Epstein-related documents and discussions. His name appeared in Epstein's contact records. Thiel has not been accused of involvement in any criminal activity related to Epstein.",
  "prince-andrew": "Prince Andrew, Duke of York, had a well-documented relationship with Jeffrey Epstein that continued after Epstein's 2008 conviction. Virginia Giuffre accused Prince Andrew of sexual abuse, a claim he denied. He reached a financial settlement with Giuffre in 2022 without admitting liability. Photographs place him with Epstein and Maxwell on multiple occasions. He stepped back from royal duties in 2019 over the controversy.",
  "reid-hoffman": "Reid Hoffman, co-founder of LinkedIn, acknowledged meeting with Jeffrey Epstein on multiple occasions for fundraising purposes. He issued a public apology in 2019 for the association, saying he was told Epstein had served his time. His name appeared in Epstein's contact records.",
  "richard-berman": "Richard Berman is a U.S. District Judge who presided over the federal criminal case against Jeffrey Epstein in 2019 in the Southern District of New York. After Epstein's death, Berman oversaw hearings giving accusers the opportunity to make statements in court.",
  "ro-khanna": "Ro Khanna is a U.S. Representative from California who has called for full disclosure of Epstein-related documents and greater accountability from federal agencies involved in the case.",
  "sarah-kellen": "Sarah Kellen, also known as Sarah Kensington, was named in court documents as one of Epstein's associates who allegedly helped recruit and schedule underage girls. She was identified as a potential co-conspirator in Epstein's 2008 plea deal but was not charged under its terms. She has denied wrongdoing.",
  "sergey-brin": "Sergey Brin, co-founder of Google, has been named in Epstein-related documents. His name appeared in Epstein's contact records. Brin has not been accused of involvement in any criminal activity connected to Epstein.",
  "steve-bannon": "Steve Bannon, former White House strategist, has been vocal in public discussions about the Epstein case and has called for full disclosure of all associated documents and names.",
  "steve-tisch": "Steve Tisch, co-owner of the New York Giants and film producer, has been named in Epstein-related documents. His name appeared in Epstein's contact book. Tisch has not been accused of involvement in any criminal activity related to Epstein.",
  "thomas-massie": "Thomas Massie is a U.S. Representative from Kentucky who has pushed for congressional action on Epstein-related document releases and has questioned federal agencies about their handling of the case.",
  "thorbjorn-jagland": "Thorbjørn Jagland, former Prime Minister of Norway and former Secretary General of the Council of Europe, has been named in Epstein-related documents. Norwegian authorities have investigated his connections to Epstein, including reported meetings. Jagland has faced formal charges in Norway related to these connections.",
  "thorbjørn-jagland": "Thorbjørn Jagland, former Prime Minister of Norway and former Secretary General of the Council of Europe, has been named in Epstein-related documents. Norwegian authorities have investigated his connections to Epstein, including reported meetings. Jagland has faced formal charges in Norway related to these connections.",
  "todd-blanche": "Todd Blanche is an attorney who has been involved in legal proceedings related to figures connected to the Epstein case. His role in Epstein-related matters has drawn public attention.",
  "vladimir-putin": "Vladimir Putin's name has appeared in Epstein-related discussions and document releases. Claims about connections between Putin and Epstein have circulated but remain unverified by court records. Putin has not been directly implicated in Epstein's criminal activities in any unsealed documents.",
  "virginia-giuffre": "According to court documents and depositions, Virginia Giuffre alleges she was recruited by Ghislaine Maxwell at age 17 to work at Jeffrey Epstein's Palm Beach residence, where she claims she was subsequently trafficked and sexually abused by Epstein and others in his network. Flight logs released in court proceedings show her name on passenger manifests for Epstein's private aircraft on multiple occasions. Giuffre has been a key witness in various legal proceedings related to Epstein's alleged trafficking network, though some defendants named in her civil lawsuits have denied her allegations. Her accusations have been central to several high-profile legal cases stemming from the Epstein scandal."
}